# wsEditEnd

## Description
Finishes workspace edit started with wsEditBegin.

```pascal
FUNCTION wsEditEnd(restart : BOOLEAN) : BOOLEAN;
```

```python

def vs.wsEditEnd(restart):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|restart|BOOLEAN||

## Version
Availability: from Vectorworks 2018
## Category
* Workspaces